In [1]:
import pandas as pd

In [11]:
num_show_lines = 3

In [76]:
min_date = "2020-02-01"
max_date = "2020-06-30"
top = 2

In [2]:
product_fname = "product.csv"
sales_fname = "sales.csv"
store_fname = "store.csv"

In [3]:
product_df = pd.read_csv(product_fname)
sales_df = pd.read_csv(sales_fname)
store_df = pd.read_csv(store_fname)

In [12]:
product_df[:num_show_lines]

    id   name     brand
0  101  p-101  yoyodyne
1  102  p-102      duff
2  103  p-103  yoyodyne

In [13]:
sales_df[:num_show_lines]

         date  product  store  quantity
0  2020-06-07      114      5         2
1  2020-05-25      106      7         8
2  2020-02-05      108      3         7

In [14]:
store_df[:num_show_lines]

   id name       city
0   1  s-1     gotham
1   2  s-2  coruscant
2   3  s-3  coruscant

In [145]:
date_mask = ((sales_df["date"] >= min_date) & 
             (sales_df["date"] <= max_date))

In [49]:
masked_sales_df = sales_df[date_mask]

In [146]:
top_seller_product_df = masked_sales_df.loc[:, ["product", "quantity"]]\
                .groupby("product")\
                .sum()\
                .nlargest(top, 'quantity', keep="all")

         quantity
product
103            33
102            24
110            24

In [128]:
print("-- top seller product --")
pd.merge(top_seller_product_df, 
         product_df, 
         left_on="product", right_on="id").loc[:, ["name", "quantity"]]

-- top seller product --

    name  quantity
0  p-103        33
1  p-102        24
2  p-110        24

In [129]:
top_seller_store_df = masked_sales_df.loc[:, ["store", "quantity"]]\
                .groupby("store")\
                .sum()\
                .nlargest(top, 'quantity', keep="all")

In [132]:
print("-- top seller store --")
pd.merge(top_seller_store_df, 
         store_df, 
         left_on="store", right_on="id").loc[:, ["name", "quantity"]]

-- top seller store --

  name  quantity
0  s-3        42
1  s-2        36
2  s-7        36

In [137]:
top_seller_brand_df = pd.merge(masked_sales_df, 
         product_df, 
         left_on="product", right_on="id").loc[:, ["brand", "quantity"]]

In [139]:
print("-- top seller brand --")
top_seller_brand_df.groupby("brand")\
                .sum()\
                .nlargest(top, 'quantity', keep="all")

-- top seller brand --

          quantity
brand
yoyodyne       100
acme            65

In [148]:
df_names = {
    "product" : product_df,
    "store" : store_df,
}

In [149]:
def find_top_seller(join_ds, att_name, ):
    top_seller_df = pd.merge(masked_sales_df, 
                             df_names[join_ds], 
                             left_on=join_ds, right_on="id")\
                        .loc[:, [att_name, "quantity"]]
    top_seller_df = top_seller_df.groupby(att_name)\
                .sum()\
                .nlargest(top, 'quantity', keep="all")
    print(f"-- top seller {att_name} --")
    print(top_seller_df)

In [152]:
find_top_seller("product", "name")
find_top_seller("store", "name")
find_top_seller("product", "brand")
find_top_seller("store", "city")

-- top seller name --
       quantity
name
p-103        33
p-102        24
p-110        24
-- top seller name --
      quantity
name
s-3         42
s-2         36
s-7         36
-- top seller brand --
          quantity
brand
yoyodyne       100
acme            65
-- top seller city --
           quantity
city
gotham          108
coruscant        78

find_top_seller("product", "name")
find_top_seller("store", "name")
find_top_seller("product", "brand")
find_top_seller("store", "city")

In [143]:
top_seller_city_df = pd.merge(masked_sales_df, 
         store_df, 
         left_on="store", right_on="id").loc[:, ["city", "quantity"]]

In [144]:
print("-- top seller city --")
top_seller_city_df.groupby("city")\
                .sum()\
                .nlargest(top, 'quantity', keep="all")

-- top seller city --

           quantity
city
gotham          108
coruscant        78